#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.rg: Reading...
azurerm_container_app_environment_dapr_component.cron: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sayhello]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
azurerm_container_app.app: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/containerApps/biotrackr-auth]
data.azurerm_resource_group.rg: Read complete after 0s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_container_registry.acr: Reading...
data.azurerm_user_assigned_identity.msi: Reading...
data.azurerm_container_app_environment.env: Reading...
data.azurerm_user_assigned_identity.msi: Read complete after 1s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
data.azurerm_container_registry.acr: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
data.azurerm_container_app_environment.env: Read complete after 2s [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.app will be destroyed
  # (because azurerm_container_app.app is not in configuration)
  - resource "azurerm_container_app" "app" {
      - container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/containerApps/biotrackr-auth" -> null
      - latest_revision_fqdn          = "biotrackr-auth--tq7equa.gentleforest-e4bb246f.australiaeast.azurecontainerapps.io" -> null
      - latest_revision_name          = "biotrackr-auth--tq7equa" -> null
      - location                      = "australiaeast" -> null
      - name                          = "biotrackr-auth" -> null
      - outbound_ip_addresses         = [
          - "4.237.162.52",
        ] -> null
      - resource_group_name           = "rg-biotrackr-prod-ae" -> null
      - revision_mode                 = "Multiple" -> null
      - tags                          = {
          - "Application" = "biotrackr"
          - "Component"   = "Auth"
          - "environment" = "Production"
          - "owner"       = "willvelida"
        } -> null
        # (1 unchanged attribute hidden)

      - dapr {
          - app_id       = "biotrackr-auth" -> null
          - app_port     = 8080 -> null
          - app_protocol = "http" -> null
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ] -> null
          - type         = "UserAssigned" -> null
            # (2 unchanged attributes hidden)
        }

      - ingress {
          - allow_insecure_connections = false -> null
          - exposed_port               = 0 -> null
          - external_enabled           = true -> null
          - fqdn                       = "biotrackr-auth.gentleforest-e4bb246f.australiaeast.azurecontainerapps.io" -> null
          - target_port                = 8080 -> null
          - transport                  = "auto" -> null

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
                # (2 unchanged attributes hidden)
            }
        }

      - registry {
          - identity             = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae" -> null
          - server               = "acrbiotrackrprodae.azurecr.io" -> null
            # (2 unchanged attributes hidden)
        }

      - template {
          - max_replicas    = 3 -> null
          - min_replicas    = 1 -> null
            # (1 unchanged attribute hidden)

          - container {
              - args              = [] -> null
              - command           = [] -> null
              - cpu               = 0.25 -> null
              - ephemeral_storage = "1Gi" -> null
              - image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth-api:12946057e58573bd8dc93a02c3970607077d4514" -> null
              - memory            = "0.5Gi" -> null
              - name              = "biotrackr-auth" -> null
            }
        }
    }

  # azurerm_container_app_environment_dapr_component.cron will be destroyed
  # (because azurerm_container_app_environment_dapr_component.cron is not in configuration)
  - resource "azurerm_container_app_environment_dapr_component" "cron" {
      - component_type               = "bindings.cron" -> null
      - container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae" -> null
      - id                           = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae/daprComponents/sayhello" -> null
      - ignore_errors                = false -> null
      - init_timeout                 = "5s" -> null
      - name                         = "sayhello" -> null
      - scopes                       = [
          - "biotrackr-auth",
        ] -> null
      - version                      = "v1" -> null

      - metadata {
          - name        = "schedule" -> null
          - value       = "@every 10m" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_container_app_job.job will be created
  + resource "azurerm_container_app_job" "job" {
      + container_app_environment_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + event_stream_endpoint        = (known after apply)
      + id                           = (known after apply)
      + location                     = "australiaeast"
      + name                         = "biotrackr-auth"
      + outbound_ip_addresses        = (known after apply)
      + replica_retry_limit          = 3
      + replica_timeout_in_seconds   = 60
      + resource_group_name          = "rg-biotrackr-prod-ae"
      + tags                         = {
          + "Application" = "biotrackr"
          + "Component"   = "Auth"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + registries (known after apply)

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + schedule_trigger_config {
          + cron_expression          = "*/15 * * * *"
          + parallelism              = 1
          + replica_completion_count = 1
        }

      + secret (known after apply)

      + secrets (known after apply)

      + template {
          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-auth:c4c3b930e83d7adff0f5a987882a37225156a483"
              + memory            = "0.5Gi"
              + name              = "biotrackr-auth"
            }
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*